#include <iostream>
using namespace std;
int main()

{   // приклад з лекції
    int A, B; //цілі числа
    A = 123; //значення для змінної
    B = 45; //значення для змінної
    cout << A << " " << B <<endl; // виводимо дані

    int C = A; //змінна для swap
    A = B; // свапаємо :)
    B = C;

    // приклад функція SWAP
    /*swap (A, B);*/
    
    // придумав gpt, але дуже схоже на кола Ейлера
    /*A = A + B;
    B = A - B;
    A = A - B;*/

    cout << A << " " << B; // виводимо дані
}

